app/controllers/articles_controller.rb

    def create
        # @article = Article.new(params[:article]).permit(:title, :text)
        @article = Article.new(article_params)
        if @article.save
---
INSERT INTO `articles` (`title`, `text`, `created_at`, `updated_at`) VALUES ('first blog', 'hello boy', '2018-08-01 09:16:53', '2018-08-01 09:16:53')

    def update
        @article = Article.find(params[:id])

        if @article.update(article_params)
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 2 LIMIT 1
UPDATE `articles` SET `title` = 'saddasdsa', `updated_at` = '2018-08-01 08:20:34' WHERE `articles`.`id` = 2