app/controllers/comments_controller.rb

    def destroy
        @article =Article.find(params[:article_id])
        @comment = @article.comments.find(params[:id])
        @comment.destroy
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
SELECT  `comments`.* FROM `comments` WHERE `comments`.`article_id` = 1 AND `comments`.`id` IS NULL LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 1